Revit 2027 API
Subelement.GetValidTypes Method
 Obtains a set of types that are valid for this subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetValidTypes()
Public Function GetValidTypes As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetValidTypes()
member GetValidTypes : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 A set of element IDs of types that are valid for this subelement or an empty set if subelement cannot have type assigned.
Remarks
 A type is valid for a subelement if it can be assigned to the subelement.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace